
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.2 实例 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="1-3_elements_of_rl.html" />
    
    
    <link rel="prev" href="1-1_reinforcement_learning.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../0_preface/0-1_second_edition_preface.html">
            
                <a href="../0_preface/0-1_second_edition_preface.html">
            
                    
                    第二版序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../0_preface/0-2_first_edition_preface.html">
            
                <a href="../0_preface/0-2_first_edition_preface.html">
            
                    
                    第一版序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../0_preface/0-3_summary_of_notation.html">
            
                <a href="../0_preface/0-3_summary_of_notation.html">
            
                    
                    标识一览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="1-0_overview.html">
            
                <a href="1-0_overview.html">
            
                    
                    第一章 引言
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="1-1_reinforcement_learning.html">
            
                <a href="1-1_reinforcement_learning.html">
            
                    
                    1.1 强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5.2" data-path="1-2_examples.html">
            
                <a href="1-2_examples.html">
            
                    
                    1.2 实例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="1-3_elements_of_rl.html">
            
                <a href="1-3_elements_of_rl.html">
            
                    
                    1.3 强化学习的组成元素
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="1-4_limitations_and_scope.html">
            
                <a href="1-4_limitations_and_scope.html">
            
                    
                    1.4 范围与局限
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.5" data-path="1-5_an_extended_example.html">
            
                <a href="1-5_an_extended_example.html">
            
                    
                    1.5 一个拓展实例: 井字棋
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.6" data-path="1-6_summary.html">
            
                <a href="1-6_summary.html">
            
                    
                    1.6 总结
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.7" data-path="1-7_early_history_of_rl.html">
            
                <a href="1-7_early_history_of_rl.html">
            
                    
                    1.7 强化学习的早期历史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.8" data-path="1-8_bibliographical_remarks.html">
            
                <a href="1-8_bibliographical_remarks.html">
            
                    
                    参考文献
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../2_tabular_solution_methods/-1-1_overview.html">
            
                <a href="../2_tabular_solution_methods/-1-1_overview.html">
            
                    
                    第一部分 表格式解决方法
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-0_overview.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-0_overview.html">
            
                    
                    第二章 多摇臂赌博机
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1.1" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-1_a_k-armd_bandit_problem.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-1_a_k-armd_bandit_problem.html">
            
                    
                    2.1 k-摇臂赌博机问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.2" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-2_action-value_methods.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-2_action-value_methods.html">
            
                    
                    2.2 动作值方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.3" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-3_the_10-armed_testbed.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-3_the_10-armed_testbed.html">
            
                    
                    2.3 10-摇臂测试工具
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.4" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-4_incremental_implementation.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-4_incremental_implementation.html">
            
                    
                    2.4 增量式实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.5" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-5_tracking_a_nonstationary_problem.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-5_tracking_a_nonstationary_problem.html">
            
                    
                    2.5 追踪非固定性问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.6" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-6_optimistic_initial_values.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-6_optimistic_initial_values.html">
            
                    
                    2.6 乐观初始值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.7" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-7_UCB_action_selection.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-7_UCB_action_selection.html">
            
                    
                    2.7 上置信界动作选择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.8" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-8_gradient_bandit_algorithm.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-8_gradient_bandit_algorithm.html">
            
                    
                    2.8 梯度赌博机算法
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >1.2 实例</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="12-&#x5B9E;&#x4F8B;">1.2 &#x5B9E;&#x4F8B;</h1>
<p>&#x4E00;&#x4E2A;&#x7406;&#x89E3;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x662F;&#x4E86;&#x89E3;&#x4E00;&#x4E9B;&#x5B9E;&#x4F8B;&#x6216;&#x5F15;&#x5BFC;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x53D1;&#x5C55;&#x7684;&#x53EF;&#x80FD;&#x7684;&#x5E94;&#x7528;.</p>
<ul>
<li>&#x4E00;&#x4E2A;&#x5BCC;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x8C61;&#x68CB;&#x9009;&#x624B;&#x4E0B;&#x4E86;&#x4E00;&#x6B65;&#x68CB;. &#x8FD9;&#x4E2A;&#x9009;&#x62E9;&#x53D7;&#x5230;&#x4E86;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x7684;&#x542F;&#x53D1;: &#x4E00;&#x662F;&#x8BA1;&#x5212;, &#x5373;&#x9884;&#x6D4B;&#x53EF;&#x80FD;&#x7684;&#x56DE;&#x51FB;&#x4EE5;&#x53CA;&#x5BF9;&#x56DE;&#x51FB;&#x7684;&#x56DE;&#x51FB;; &#x4E8C;&#x662F;&#x5BF9;&#x7279;&#x5B9A;&#x4F4D;&#x7F6E;&#x4E0E;&#x79FB;&#x52A8;&#x7684;&#x4EF7;&#x503C;&#x7684;&#x51ED;&#x76F4;&#x89C9;&#x7684;&#x7ACB;&#x5373;&#x5224;&#x65AD;. </li>
<li>&#x4E00;&#x4E2A;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x63A7;&#x5236;&#x5668;&#x5B9E;&#x65F6;&#x5730;&#x8C03;&#x6574;&#x70BC;&#x6CB9;&#x5382;&#x751F;&#x4EA7;&#x7684;&#x5404;&#x4E2A;&#x53C2;&#x6570;. &#x63A7;&#x5236;&#x5668;&#x5728;&#x8BBE;&#x5B9A;&#x7684;&#x6D88;&#x8017;&#x7684;&#x8303;&#x56F4;&#x5185;, &#x4F18;&#x5316;&#x4EA7;&#x51FA;/&#x6D88;&#x8017;/&#x8D28;&#x91CF;&#x7684;&#x4E4B;&#x95F4;&#x6743;&#x8861;, &#x800C;&#x4E0D;&#x5FC5;&#x4F7F;&#x503C;&#x4E25;&#x683C;&#x5730;&#x9075;&#x4ECE;&#x5DE5;&#x7A0B;&#x5E08;&#x5EFA;&#x8BAE;&#x7684;&#x9884;&#x8BBE;&#x503C;. </li>
<li>&#x7F9A;&#x7F8A;&#x5E7C;&#x5D3D;&#x5728;&#x51FA;&#x751F;&#x51E0;&#x5206;&#x949F;&#x540E;&#x5C31;&#x80FD;&#x6323;&#x624E;&#x7740;&#x7AD9;&#x8D77;&#x6765;. &#x534A;&#x4E2A;&#x5C0F;&#x65F6;&#x540E;&#x5B83;&#x5C31;&#x80FD;&#x4EE5;20&#x82F1;&#x91CC;&#x6BCF;&#x5C0F;&#x65F6;&#x7684;&#x901F;&#x5EA6;&#x5954;&#x8DD1;.</li>
<li>&#x4E00;&#x4E2A;&#x80FD;&#x79FB;&#x52A8;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x51B3;&#x5B9A;&#x5B83;&#x5E94;&#x8BE5;&#x662F;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x623F;&#x95F4;&#x6765;&#x641C;&#x7D22;&#x66F4;&#x591A;&#x7684;&#x5783;&#x573E;&#x8FD8;&#x662F;&#x5F00;&#x59CB;&#x8BD5;&#x56FE;&#x5BFB;&#x627E;&#x56DE;&#x5230;&#x5145;&#x7535;&#x7AD9;&#x7684;&#x8DEF;. &#x5B83;&#x57FA;&#x4E8E;&#x5F53;&#x524D;&#x7684;&#x7535;&#x91CF;&#x6C34;&#x5E73;&#x4E0E;&#x8FC7;&#x53BB;&#x5B83;&#x53D1;&#x73B0;&#x5145;&#x7535;&#x5668;&#x7684;&#x901F;&#x5EA6;&#x4E0E;&#x96BE;&#x6613;&#x5EA6;&#x6765;&#x505A;&#x51FA;&#x51B3;&#x5B9A;.</li>
<li>&#x83F2;&#x5C14;&#x51C6;&#x5907;&#x4ED6;&#x7684;&#x65E9;&#x9910;. &#x5982;&#x679C;&#x4ED4;&#x7EC6;&#x68C0;&#x67E5;&#x7684;&#x8BDD;, &#x5373;&#x4F7F;&#x662F;&#x8FD9;&#x6837;&#x666E;&#x901A;&#x7684;&#x6D3B;&#x52A8;&#x4E5F;&#x63ED;&#x9732;&#x51FA;&#x4E00;&#x5F20;&#x7531;&#x6761;&#x4EF6;&#x884C;&#x4E3A;&#x548C;&#x8FDE;&#x9501;&#x7684;&#x76EE;&#x6807;-&#x5B50;&#x76EE;&#x6807;&#x5173;&#x7CFB;&#x7EC4;&#x6210;&#x7684;&#x590D;&#x6742;&#x7684;&#x7F51;: &#x8D70;&#x5411;&#x98DF;&#x7269;&#x67DC;, &#x6253;&#x5F00;&#x98DF;&#x7269;&#x67DC;, &#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8C37;&#x7269;&#x76D2;, &#x7136;&#x540E;&#x5C06;&#x624B;&#x4F38;&#x5411;&#x5B83;, &#x6293;&#x4F4F;&#x5B83;, &#x6700;&#x540E;&#x5C06;&#x76D2;&#x5B50;&#x53D6;&#x56DE;. &#x5176;&#x4ED6;&#x590D;&#x6742;&#x7684;&#x3001;&#x719F;&#x7EC3;&#x7684;&#x3001;&#x4EA4;&#x4E92;&#x7684;&#x52A8;&#x4F5C;&#x5E8F;&#x5217;&#x4E5F;&#x88AB;&#x53D6;&#x56DE;&#x4E00;&#x4E2A;&#x7897;&#x3001;&#x6C64;&#x5319;&#x6216;&#x725B;&#x5976;&#x76D2;&#x6240;&#x9700;&#x8981;. &#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x773C;&#x7403;&#x8FD0;&#x52A8;, &#x4E3A;&#x4E86;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x6307;&#x5BFC;&#x4F38;&#x624B;&#x4E0E;&#x5176;&#x4ED6;&#x52A8;&#x4F5C;. &#x5224;&#x65AD;&#x88AB;&#x8FC5;&#x901F;&#x5730;&#x505A;&#x51FA;: &#x600E;&#x6837;&#x62FF;&#x8FD9;&#x4E2A;&#x7269;&#x4F53;, &#x6216;&#x5728;&#x53D6;&#x522B;&#x7684;&#x7269;&#x54C1;&#x524D;&#x5148;&#x5C06;&#x624B;&#x5934;&#x4E0A;&#x7684;&#x62FF;&#x5230;&#x9910;&#x684C;&#x4E0A;&#x662F;&#x5426;&#x66F4;&#x597D;. &#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x662F;&#x7531;&#x76EE;&#x6807;&#x6307;&#x5BFC;&#x7684;, &#x6BD4;&#x5982;&#x6293;&#x4E00;&#x4E2A;&#x6C64;&#x5319;&#x6216;&#x53BB;&#x51B0;&#x7BB1;&#x90A3;&#x91CC;, &#x5E76;&#x4E14;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x662F;&#x4E3A;&#x5176;&#x4ED6;&#x7684;&#x76EE;&#x6807;&#x670D;&#x52A1;, &#x4F8B;&#x5982;&#x5F53;&#x8C37;&#x7269;&#x51C6;&#x5907;&#x597D;&#x540E;&#x4F7F;&#x7528;&#x6C64;&#x5319;&#x6765;&#x5403;&#x5B83;&#x5E76;&#x6700;&#x7EC8;&#x83B7;&#x5F97;&#x8425;&#x517B;. &#x65E0;&#x8BBA;&#x4ED6;&#x6709;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E00;&#x70B9;, &#x83F2;&#x5C14;&#x4E00;&#x76F4;&#x5728;&#x83B7;&#x53D6;&#x5173;&#x4E8E;&#x8EAB;&#x4F53;&#x7684;&#x72B6;&#x6001;&#x4FE1;&#x606F;, &#x8FD9;&#x4E9B;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x786E;&#x5B9A;&#x4E86;&#x4ED6;&#x7684;&#x8425;&#x517B;&#x9700;&#x6C42;, &#x9965;&#x997F;&#x7684;&#x7B49;&#x7EA7;, &#x4EE5;&#x53CA;&#x4E8B;&#x7269;&#x4E0A;&#x7684;&#x504F;&#x597D;.</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x5B9E;&#x4F8B;&#x5171;&#x6709;&#x8FC7;&#x4E8E;&#x57FA;&#x672C;&#x4EE5;&#x81F4;&#x4E8E;&#x5BB9;&#x6613;&#x88AB;&#x5FFD;&#x89C6;&#x7684;&#x7279;&#x70B9;. &#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5B9E;&#x4F8B;&#x90FD;&#x6D89;&#x53CA;&#x5230;&#x505A;&#x51B3;&#x7B56;&#x7684;&#x4EE3;&#x7406;&#x53CA;&#x5176;&#x73AF;&#x5883;&#x95F4;&#x7684;<em>&#x4EA4;&#x4E92;</em>, &#x5728;&#x4EA4;&#x4E92;&#x4E2D;&#x867D;&#x7136;&#x9762;&#x5BF9;&#x7740;&#x73AF;&#x5883;&#x4E2D;&#x7684;<em>&#x4E0D;&#x786E;&#x5B9A;&#x6027;</em>&#x4F46;&#x4EE3;&#x7406;&#x5BFB;&#x6C42;&#x8FBE;&#x5230;&#x7279;&#x5B9A;&#x7684;<em>&#x76EE;&#x6807;</em>. &#x4EE3;&#x7406;&#x7684;&#x52A8;&#x4F5C;&#x80FD;&#x591F;&#x5F71;&#x54CD;&#x73AF;&#x5883;&#x7684;&#x672A;&#x6765;&#x72B6;&#x6001;(&#x4F8B;&#x5982;&#x4E0B;&#x4E00;&#x6B65;&#x68CB;&#x7684;&#x4F4D;&#x7F6E;, &#x70BC;&#x6CB9;&#x5382;&#x4E2D;&#x50A8;&#x84C4;&#x6C60;&#x7684;&#x6CB9;&#x4F4D;, &#x673A;&#x5668;&#x4EBA;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x4EE5;&#x53CA;&#x7535;&#x6C60;&#x7684;&#x672A;&#x6765;&#x7535;&#x91CF;), &#x56E0;&#x6B64;&#x80FD;&#x591F;&#x5F71;&#x54CD;&#x4EE3;&#x7406;&#x540E;&#x7EED;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x7684;&#x52A8;&#x4F5C;&#x4EE5;&#x53CA;&#x9762;&#x5BF9;&#x7684;&#x673A;&#x4F1A;. &#x6B63;&#x786E;&#x7684;&#x9009;&#x62E9;&#x9700;&#x8981;&#x5C06;&#x95F4;&#x63A5;&#x7684;&#x3001;&#x5EF6;&#x8FDF;&#x7684;&#x52A8;&#x4F5C;&#x5E8F;&#x5217;&#x8003;&#x8651;&#x5728;&#x5185;, &#x56E0;&#x6B64;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8FDC;&#x89C1;&#x6216;&#x8BA1;&#x5212;.</p>
<p>&#x4E0E;&#x6B64;&#x540C;&#x65F6;, &#x5728;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E9B;&#x5B9E;&#x4F8B;&#x4E2D;&#x52A8;&#x4F5C;&#x7684;&#x6548;&#x679C;&#x4E0D;&#x80FD;&#x88AB;&#x5B8C;&#x5168;&#x9884;&#x6D4B;, &#x56E0;&#x6B64;&#x4EE3;&#x7406;&#x5FC5;&#x987B;&#x9891;&#x7E41;&#x5730;&#x76D1;&#x89C6;&#x73AF;&#x5883;&#x5E76;&#x4F5C;&#x51FA;&#x5408;&#x9002;&#x7684;&#x53CD;&#x5E94;. &#x4F8B;&#x5982;, &#x83F2;&#x5C14;&#x5FC5;&#x987B;&#x67E5;&#x770B;&#x5012;&#x5165;&#x7897;&#x4E2D;&#x7684;&#x725B;&#x5976;&#x7684;&#x91CF;&#x4EE5;&#x9632;&#x6B62;&#x725B;&#x5976;&#x6EA2;&#x51FA;. &#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5B9E;&#x4F8B;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x76EE;&#x6807;, &#x660E;&#x786E;&#x5C31;&#x660E;&#x786E;&#x5728;&#x4EE3;&#x7406;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x5176;&#x80FD;&#x76F4;&#x63A5;&#x611F;&#x77E5;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x6765;&#x5224;&#x65AD;&#x79BB;&#x76EE;&#x6807;&#x6709;&#x591A;&#x8FD1;. &#x68CB;&#x624B;&#x77E5;&#x9053;&#x4ED6;&#x662F;&#x5426;&#x8D62;&#x4E86;, &#x70BC;&#x6CB9;&#x5382;&#x63A7;&#x5236;&#x5668;&#x77E5;&#x9053;&#x591A;&#x5C11;&#x6CB9;&#x6B63;&#x5728;&#x88AB;&#x751F;&#x4EA7;, &#x7F9A;&#x7F8A;&#x5E7C;&#x5D3D;&#x80FD;&#x5BDF;&#x89C9;&#x5230;&#x5B83;&#x8DCC;&#x5012;&#x4E86;, &#x673A;&#x5668;&#x4EBA;&#x80FD;&#x5224;&#x65AD;&#x5B83;&#x7684;&#x7535;&#x91CF;&#x662F;&#x5426;&#x8017;&#x5C3D;&#x4E86;, &#x83F2;&#x5C14;&#x77E5;&#x9053;&#x4ED6;&#x662F;&#x5426;&#x4EAB;&#x53D7;&#x4ED6;&#x7684;&#x65E9;&#x9910;.</p>
<p>&#x5728;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E9B;&#x5B9E;&#x4F8B;&#x4E2D;, &#x4EE3;&#x7406;&#x80FD;&#x591F;&#x9010;&#x6E10;&#x5730;&#x5229;&#x7528;&#x5176;&#x7ECF;&#x9A8C;&#x6765;&#x63D0;&#x5347;&#x8868;&#x73B0;. &#x8C61;&#x68CB;&#x9009;&#x624B;&#x63D0;&#x5347;&#x4E86;&#x7528;&#x4E8E;&#x8BC4;&#x4F30;&#x4E0D;&#x540C;&#x4F4D;&#x7F6E;&#x7684;&#x76F4;&#x89C9;, &#x56E0;&#x6B64;&#x6539;&#x5584;&#x4E86;&#x4ED6;&#x7684;&#x4E0B;&#x68CB;&#x6280;&#x5DE7;; &#x7F9A;&#x7F8A;&#x5E7C;&#x5D3D;&#x63D0;&#x5347;&#x4E86;&#x5954;&#x8DD1;&#x7684;&#x6548;&#x7387;; &#x83F2;&#x5C14;&#x5B66;&#x4F1A;&#x4E86;&#x4F7F;&#x7528;&#x6D41;&#x6C34;&#x7EBF;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5236;&#x4F5C;&#x65E9;&#x9910;. &#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x4EE3;&#x7406;&#x5E26;&#x5165;&#x4EFB;&#x52A1;&#x7684;&#x77E5;&#x8BC6;&#x2014;&#x2014;&#x65E0;&#x8BBA;&#x662F;&#x4ECE;&#x5148;&#x524D;&#x7684;&#x5173;&#x8054;&#x4EFB;&#x52A1;&#x83B7;&#x5F97;&#x7684;&#x7ECF;&#x9A8C;, &#x6216;&#x901A;&#x8FC7;&#x8BBE;&#x8BA1;&#x6216;&#x6F14;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5E26;&#x5165;&#x7684;&#x2014;&#x2014;&#x5F71;&#x54CD;&#x4E86;&#x54EA;&#x4E9B;&#x5BF9;&#x4E8E;&#x5B66;&#x4E60;&#x662F;&#x6709;&#x7528;&#x7684;&#x6216;&#x8005;&#x54EA;&#x4E9B;&#x5BB9;&#x6613;&#x5B66;&#x4E60;, &#x4F46;&#x662F;&#x540C;&#x73AF;&#x5883;&#x7684;&#x4EA4;&#x4E92;&#x5BF9;&#x4E8E;&#x8C03;&#x6574;&#x52A8;&#x4F5C;&#x6765;&#x5229;&#x7528;&#x8BE5;&#x4EFB;&#x52A1;&#x7684;&#x5177;&#x4F53;&#x7279;&#x5F81;&#x662F;&#x5FC5;&#x987B;&#x7684;. </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="1-1_reinforcement_learning.html" class="navigation navigation-prev " aria-label="Previous page: 1.1 强化学习">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="1-3_elements_of_rl.html" class="navigation navigation-next " aria-label="Next page: 1.3 强化学习的组成元素">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.2 实例","level":"1.5.2","depth":2,"next":{"title":"1.3 强化学习的组成元素","level":"1.5.3","depth":2,"path":"src/1_introduction/1-3_elements_of_rl.md","ref":"src/1_introduction/1-3_elements_of_rl.md","articles":[]},"previous":{"title":"1.1 强化学习","level":"1.5.1","depth":2,"path":"src/1_introduction/1-1_reinforcement_learning.md","ref":"src/1_introduction/1-1_reinforcement_learning.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["mathjax","livereload"],"pluginsConfig":{"mathjax":{"forceSVG":false,"version":"2.6-latest"},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"src/1_introduction/1-2_examples.md","mtime":"2018-07-18T13:38:19.353Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-07-25T08:51:18.745Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

