
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一版序 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="0-3_summary_of_notation.html" />
    
    
    <link rel="prev" href="0-1_second_edition_preface.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="0-1_second_edition_preface.html">
            
                <a href="0-1_second_edition_preface.html">
            
                    
                    第二版序
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="0-2_first_edition_preface.html">
            
                <a href="0-2_first_edition_preface.html">
            
                    
                    第一版序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="0-3_summary_of_notation.html">
            
                <a href="0-3_summary_of_notation.html">
            
                    
                    标识一览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../1_introduction/1-0_overview.html">
            
                <a href="../1_introduction/1-0_overview.html">
            
                    
                    第一章 引言
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../1_introduction/1-1_reinforcement_learning.html">
            
                <a href="../1_introduction/1-1_reinforcement_learning.html">
            
                    
                    1.1 强化学习
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="../1_introduction/1-2_examples.html">
            
                <a href="../1_introduction/1-2_examples.html">
            
                    
                    1.2 实例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="../1_introduction/1-3_elements_of_rl.html">
            
                <a href="../1_introduction/1-3_elements_of_rl.html">
            
                    
                    1.3 强化学习的组成元素
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.4" data-path="../1_introduction/1-4_limitations_and_scope.html">
            
                <a href="../1_introduction/1-4_limitations_and_scope.html">
            
                    
                    1.4 范围与局限
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.5" data-path="../1_introduction/1-5_an_extended_example.html">
            
                <a href="../1_introduction/1-5_an_extended_example.html">
            
                    
                    1.5 一个拓展实例: 井字棋
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.6" data-path="../1_introduction/1-6_summary.html">
            
                <a href="../1_introduction/1-6_summary.html">
            
                    
                    1.6 总结
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.7" data-path="../1_introduction/1-7_early_history_of_rl.html">
            
                <a href="../1_introduction/1-7_early_history_of_rl.html">
            
                    
                    1.7 强化学习的早期历史
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.8" data-path="../1_introduction/1-8_bibliographical_remarks.html">
            
                <a href="../1_introduction/1-8_bibliographical_remarks.html">
            
                    
                    参考文献
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../2_tabular_solution_methods/-1-1_overview.html">
            
                <a href="../2_tabular_solution_methods/-1-1_overview.html">
            
                    
                    第一部分 表格式解决方法
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-0_overview.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-0_overview.html">
            
                    
                    第二章 多摇臂赌博机
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1.1" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-1_a_k-armd_bandit_problem.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-1_a_k-armd_bandit_problem.html">
            
                    
                    2.1 k-摇臂赌博机问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.2" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-2_action-value_methods.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-2_action-value_methods.html">
            
                    
                    2.2 动作值方法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.3" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-3_the_10-armed_testbed.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-3_the_10-armed_testbed.html">
            
                    
                    2.3 10-摇臂测试工具
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.4" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-4_incremental_implementation.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-4_incremental_implementation.html">
            
                    
                    2.4 增量式实现
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.5" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-5_tracking_a_nonstationary_problem.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-5_tracking_a_nonstationary_problem.html">
            
                    
                    2.5 追踪非固定性问题
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.6" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-6_optimistic_initial_values.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-6_optimistic_initial_values.html">
            
                    
                    2.6 乐观初始值
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.7" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-7_UCB_action_selection.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-7_UCB_action_selection.html">
            
                    
                    2.7 上置信界动作选择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.8" data-path="../2_tabular_solution_methods/2_multi-armd_bandits/2-8_gradient_bandit_algorithm.html">
            
                <a href="../2_tabular_solution_methods/2_multi-armd_bandits/2-8_gradient_bandit_algorithm.html">
            
                    
                    2.8 梯度赌博机算法
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >第一版序</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E00;&#x7248;&#x5E8F;">&#x7B2C;&#x4E00;&#x7248;&#x5E8F;</h1>
<p>&#x6211;&#x4EEC;&#x6700;&#x65E9;&#x5728;1979&#x5E74;&#x672B;&#x5173;&#x6CE8;&#x4E8E;&#x73B0;&#x5728;&#x88AB;&#x79F0;&#x4E3A;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x7684;&#x5B66;&#x79D1;. &#x6211;&#x4EEC;&#x90FD;&#x5728;University of Massachusetts, &#x5DE5;&#x4F5C;&#x4E8E;&#x6700;&#x65E9;&#x7684;&#x60F3;&#x8981;&#x4F7F;&quot;&#x7C7B;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x81EA;&#x9002;&#x5E94;&#x5143;&#x7D20;&#x7EC4;&#x6210;&#x7684;&#x7F51;&#x7EDC;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x6761;&#x5145;&#x6EE1;&#x524D;&#x666F;&#x7684;&#x901A;&#x5F80;&#x81EA;&#x9002;&#x5E94;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x9053;&#x8DEF;&quot;&#x8FD9;&#x4E00;&#x7406;&#x5FF5;&#x590D;&#x5174;&#x7684;&#x9879;&#x76EE;. &#x8FD9;&#x4E2A;&#x63A2;&#x7D22;&#x7531;A. Harry Klopf&#x53D1;&#x5C55;&#x7684;&quot;&#x81EA;&#x9002;&#x5E94;&#x7CFB;&#x7EDF;&#x7684;&#x591A;&#x7A33;&#x6001;&lt;heterostatic&gt;&#x7406;&#x8BBA;&quot;&#x7684;&#x9879;&#x76EE;&#x662F;&#x60F3;&#x6CD5;&#x7684;&#x91CD;&#x8981;&#x6E90;&#x6CC9;, &#x540C;&#x65F6;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x6279;&#x5224;&#x6027;&#x5730;&#x63A2;&#x7D22;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x548C;&#x62E5;&#x6709;&#x957F;&#x4E45;&#x5386;&#x53F2;&#x7684;&#x5173;&#x4E8E;&#x81EA;&#x9002;&#x5E94;&#x7CFB;&#x7EDF;&#x7684;&#x5148;&#x9A71;&#x5DE5;&#x4F5C;&#x76F8;&#x6BD4;&#x8F83;. &#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x53D8;&#x6210;&#x4E86;&#x4E0B;&#x8FF0;&#x7684;&#x4E24;&#x8005;&#x4E4B;&#x4E00;: &#x5C06;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x68B3;&#x7406;&#x5F00;&#x6765;, &#x6216;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x7684;&#x5173;&#x7CFB;&#x4E0E;&#x76F8;&#x5BF9;&#x7684;&#x91CD;&#x8981;&#x6027;. &#x8FD9;&#x4E00;&#x76F4;&#x6301;&#x7EED;&#x5230;&#x4ECA;&#x5929;, &#x4F46;&#x5728;1979&#x5E74;&#x6211;&#x4EEC;&#x7A81;&#x7136;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x5176;&#x4E2D;&#x6700;&#x7B80;&#x5355;&#x7684;&#x60F3;&#x6CD5;, &#x4E5F;&#x662F;&#x957F;&#x4E45;&#x4EE5;&#x6765;&#x4E00;&#x76F4;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x7406;&#x6240;&#x5F53;&#x7136;&#x7684;&#x60F3;&#x6CD5;, &#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4ECE;&#x8BA1;&#x7B97;&#x7684;&#x89D2;&#x5EA6;&#x53D7;&#x5230;&#x8FC7;&#x5173;&#x6CE8;. &#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5C31;&#x5355;&#x7EAF;&#x5730;&#x662F;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;<em>&#x60F3;&#x8981;</em>&#x4EC0;&#x4E48;&#x4E1C;&#x897F;, &#x6216;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x4E3A;&#x4E86;&#x4ECE;&#x73AF;&#x5883;&#x4E2D;&#x6700;&#x5927;&#x5316;&#x67D0;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x4FE1;&#x53F7;&#x800C;&#x9002;&#x5E94;&#x6027;&#x5730;&#x6539;&#x53D8;&#x884C;&#x4E3A;. &#x8FD9;&#x5C31;&#x662F;&quot;&#x4EAB;&#x4E50;&#x4E3B;&#x4E49;&quot;&lt;hedonistic&gt;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x7684;&#x7406;&#x5FF5;, &#x6216;&#x8005;&#x7528;&#x73B0;&#x5728;&#x7684;&#x8BDD;&#x8BF4;, &#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x7684;&#x7406;&#x5FF5;.</p>
<p>&#x50CF;&#x5176;&#x4ED6;&#x4EBA;&#x90A3;&#x6837;, &#x6211;&#x4EEC;&#x6709;&#x4E00;&#x79CD;&#x8FD9;&#x6837;&#x7684;&#x611F;&#x89C9;: &#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x5DF2;&#x7ECF;&#x5728;&#x795E;&#x7ECF;&#x673A;&#x68B0;&#x5B66;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x53D1;&#x5C55;&#x7684;&#x65E9;&#x671F;&#x88AB;&#x5F7B;&#x5E95;&#x5730;&#x63A2;&#x7D22;&#x8FC7;&#x4E86;. &#x7136;&#x800C;&#x5728;&#x66F4;&#x8FD1;&#x5730;&#x5BA1;&#x89C6;&#x540E;, &#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5B83;&#x53EA;&#x662F;&#x88AB;&#x6D45;&#x6D45;&#x5730;&#x63A2;&#x7D22;&#x8FC7;&#x4E86;. &#x867D;&#x7136;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x5F88;&#x660E;&#x663E;&#x5730;&#x50AC;&#x751F;&#x4E86;&#x4E00;&#x4E9B;&#x6700;&#x65E9;&#x7684;&#x5BF9;&#x5B66;&#x4E60;&#x7406;&#x8BBA;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x9762;&#x7684;&#x7814;&#x7A76;, &#x4F46;&#x5927;&#x591A;&#x6570;&#x7814;&#x7A76;&#x8005;&#x8F6C;&#x5411;&#x4E86;&#x5176;&#x4ED6;&#x4E8B;&#x7269;: &#x4F8B;&#x5982;&#x6A21;&#x5F0F;&#x5206;&#x7C7B;, &#x76D1;&#x7763;&#x5B66;&#x4E60;, &#x81EA;&#x9002;&#x5E94;&#x63A7;&#x5236;&#x7406;&#x8BBA;, &#x6216;&#x8005;&#x5E72;&#x8106;&#x653E;&#x5F03;&#x4E86;&#x5B66;&#x4E60;&#x7406;&#x8BBA;&#x7684;&#x7814;&#x7A76;. &#x4F5C;&#x4E3A;&#x7ED3;&#x679C;, &#x6D89;&#x53CA;&#x5230;&#x600E;&#x6837;&#x4ECE;&#x73AF;&#x5883;&#x4E2D;&#x83B7;&#x5F97;&#x67D0;&#x7269;&#x7684;&#x7279;&#x6B8A;&#x95EE;&#x9898;&#x76F8;&#x5BF9;&#x800C;&#x8A00;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x53D7;&#x5230;&#x5173;&#x6CE8;. &#x56DE;&#x60F3;&#x8D77;&#x6765;, &#x5173;&#x6CE8;&#x4E8E;&#x8FD9;&#x4E00;&#x7406;&#x5FF5;&#x662F;&#x4F7F;&#x5F97;&#x8FD9;&#x4E00;&#x5206;&#x652F;&#x7684;&#x7814;&#x7A76;&#x84EC;&#x52C3;&#x53D1;&#x5C55;&#x7684;&#x51B3;&#x5B9A;&#x6027;&#x7684;&#x4E00;&#x6B65;. &#x5173;&#x4E8E;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x9762;&#x7684;&#x7814;&#x7A76;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x505A;&#x51FA;&#x8FDB;&#x6B65;, &#x76F4;&#x81F3;&#x53D1;&#x73B0;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x57FA;&#x7840;&#x7684;&#x7406;&#x5FF5;&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x5F7B;&#x5E95;&#x63A2;&#x7D22;&#x8FC7;.</p>
<p>&#x4ECE;&#x90A3;&#x65F6;&#x8D77;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x9886;&#x57DF;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x957F;&#x8DB3;&#x7684;&#x53D1;&#x5C55;, &#x5E76;&#x5728;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x4E0A;&#x9010;&#x6E10;&#x8FDB;&#x6B65;&#x4E0E;&#x6210;&#x719F;. &#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x9010;&#x6E10;&#x6210;&#x4E3A;&#x4E86;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x3001;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x4EE5;&#x53CA;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65B9;&#x9762;&#x7684;&#x6700;&#x4E3A;&#x6D3B;&#x8DC3;&#x7684;&#x7814;&#x7A76;&#x9886;&#x57DF;. &#x8FD9;&#x4E00;&#x9886;&#x57DF;&#x53D1;&#x5C55;&#x51FA;&#x4E86;&#x575A;&#x5B9E;&#x7684;&#x6570;&#x5B66;&#x57FA;&#x7840;&#x4E0E;&#x4EE4;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x7684;&#x5E94;&#x7528;. &#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x9762;&#x7684;&#x7814;&#x7A76;&#x73B0;&#x5728;&#x662F;&#x4E00;&#x4E2A;&#x5BBD;&#x5E7F;&#x7684;&#x9886;&#x57DF;, &#x6709;&#x6765;&#x81EA;&#x5168;&#x7403;&#x7684;&#x6570;&#x4EE5;&#x767E;&#x8BA1;&#x7684;&#x5FC3;&#x7406;&#x5B66;&#x3001;&#x63A7;&#x5236;&#x8BBA;&#x3001;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x4E0E;&#x795E;&#x7ECF;&#x79D1;&#x5B66;&#x7B49;&#x9886;&#x57DF;&#x7684;&#x6D3B;&#x8DC3;&#x7814;&#x7A76;&#x8005;&#x53C2;&#x4E0E;&#x5176;&#x4E2D;. &#x5173;&#x4E8E;&#x5EFA;&#x7ACB;&#x4E0E;&#x53D1;&#x5C55;&#x6700;&#x4F18;&#x63A7;&#x5236;&#x7406;&#x8BBA;&#x4E0E;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x8FD9;&#x4E24;&#x8005;&#x5173;&#x7CFB;&#x7684;&#x8D21;&#x732E;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;. &#x4ECE;&#x4EA4;&#x4E92;&#x4E2D;&#x5B66;&#x4E60;&#x4EE5;&#x8FBE;&#x5230;&#x76EE;&#x6807;&#x8FD9;&#x4E00;&#x6574;&#x4F53;&#x95EE;&#x9898;&#x8FD8;&#x8FDC;&#x6CA1;&#x6709;&#x89E3;&#x51B3;, &#x4F46;&#x6211;&#x4EEC;&#x5BF9;&#x5B83;&#x7684;&#x7406;&#x89E3;&#x5DF2;&#x7ECF;&#x6781;&#x5927;&#x5730;&#x6539;&#x5584;&#x4E86;. &#x6211;&#x4EEC;&#x73B0;&#x5728;&#x80FD;&#x5C06;&#x65F6;&#x5E8F;&#x5DEE;&#x5206;&lt;temporal-difference&gt;&#x5B66;&#x4E60;&#x3001;&#x52A8;&#x6001;&#x89C4;&#x5212;&#x3001;&#x51FD;&#x6570;&#x8FD1;&#x4F3C;&#x7B49;&#x7EC4;&#x6210;&#x6982;&#x5FF5;&#x805A;&#x5408;&#x5230;&#x5BF9;&#x6574;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x7EDF;&#x4E00;&#x7684;&#x89C6;&#x56FE;&#x4E2D;. </p>
<p>&#x6211;&#x4EEC;&#x4E66;&#x5199;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6E05;&#x6670;&#x660E;&#x4E86;&#x7684;&#x5173;&#x4E8E;&#x5F3A;&#x5316;&#x5B66;&#x4E60;&#x7684;&#x5173;&#x952E;&#x6982;&#x5FF5;&#x4E0E;&#x7B97;&#x6CD5;&#x7684;&#x9610;&#x8FF0;. &#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x7684;&#x9610;&#x8FF0;&#x80FD;&#x88AB;&#x5173;&#x8054;&#x9886;&#x57DF;&#x7684;&#x8BFB;&#x8005;&#x7406;&#x89E3;, &#x4F46;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x8BE6;&#x5C3D;&#x5730;&#x6DB5;&#x76D6;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x9886;&#x57DF;. &#x5C31;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x800C;&#x8A00;, &#x6211;&#x4EEC;&#x7684;&#x9610;&#x8FF0;&#x662F;&#x4ECE;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x4E0E;&#x5DE5;&#x7A0B;&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#x7684;. &#x5BF9;&#x5176;&#x4ED6;&#x5173;&#x8054;&#x9886;&#x57DF;&#x7684;&#x6DB5;&#x76D6;, &#x6211;&#x4EEC;&#x8981;&#x4E48;&#x7559;&#x7ED9;&#x5176;&#x4ED6;&#x4F5C;&#x8005;, &#x8981;&#x4E48;&#x4EE5;&#x540E;&#x518D;&#x8BBA;. &#x6211;&#x4EEC;&#x4E5F;&#x9009;&#x62E9;&#x4E0D;&#x4EE5;&#x4E25;&#x8C28;&#x7684;&#x3001;&#x5F62;&#x5F0F;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x9610;&#x8FF0;&#x5F3A;&#x5316;&#x5B66;&#x4E60;. &#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5230;&#x8FBE;&#x53EF;&#x80FD;&#x7684;&#x6700;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x6570;&#x5B66;&#x62BD;&#x8C61;, &#x4E5F;&#x6CA1;&#x6709;&#x4F9D;&#x8D56;&#x4E8E;&#x5B9A;&#x7406;-&#x8BC1;&#x660E;&lt;theorem-proof&gt;&#x4F53;&#x7CFB;. &#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x9009;&#x62E9;&#x5448;&#x73B0;&#x7279;&#x5B9A;&#x7EA7;&#x522B;&#x7684;&#x7684;&#x6570;&#x5B66;&#x7EC6;&#x8282;: &#x8FD9;&#x6837;&#x7A0B;&#x5EA6;&#x7684;&#x7EC6;&#x8282;&#x5373;&#x80FD;&#x6307;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x6570;&#x5B66;&#x503E;&#x5411;, &#x53C8;&#x80FD;&#x907F;&#x514D;&#x5931;&#x53BB;&#x5173;&#x4E8E;&#x6839;&#x672C;&#x6982;&#x5FF5;&#x7684;&#x7B80;&#x6D01;&#x6027;&#x4E0E;&#x6F5C;&#x5728;&#x7684;&#x666E;&#x904D;&#x6027;.</p>
<p>(&#x540E;&#x4E3A;&#x81F4;&#x8C22;&#x5185;&#x5BB9;, &#x6682;&#x4E0D;&#x8BD1;)</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="0-1_second_edition_preface.html" class="navigation navigation-prev " aria-label="Previous page: 第二版序">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="0-3_summary_of_notation.html" class="navigation navigation-next " aria-label="Next page: 标识一览">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一版序","level":"1.3","depth":1,"next":{"title":"标识一览","level":"1.4","depth":1,"path":"src/0_preface/0-3_summary_of_notation.md","ref":"src/0_preface/0-3_summary_of_notation.md","articles":[]},"previous":{"title":"第二版序","level":"1.2","depth":1,"path":"src/0_preface/0-1_second_edition_preface.md","ref":"src/0_preface/0-1_second_edition_preface.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["mathjax","livereload"],"pluginsConfig":{"mathjax":{"forceSVG":false,"version":"2.6-latest"},"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"src/0_preface/0-2_first_edition_preface.md","mtime":"2018-07-12T04:27:00.900Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-07-25T08:51:18.745Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

